#!/usr/bin/perl -w
use strict;
use CGI; 
#use JSON;
#use Data::Dumper;
use vars qw( $wiki );

my $q = new CGI;
my $lang = 'ru';
my $wiki_url = '.wikipedia.org/wiki/';
my $prot = 'http://';
my $wiki_uri = ();
my $spq = $prot.'en'.$wiki_url.'System_of_Physical_Quantities';

#print $q->header(); 


my $val = $q->param('pq');
if (defined $q->param('lang')) { $lang = $q->param('lang');}
#my @vals = split(//, $val);

$wiki = {
  'v_e' => { 'ru' => 'Скорость_передачи_энергии', 'en' => 'Energy_transfer_speed', 'name' => 'Скорость передачи энергии' },
  'T' => { 'ru' => 'Время', 'en' => 'Time_in_physics', 'name' => 'Время' },
  'T_l' => {'ru' => 'Длительность_расстояния', 'en' => '', 'name' => 'Длительность расстояния' }, 
  'N_l' => {'ru' => 'Мощность', 'en' => 'Power_(physics)', 'name' => 'Мощность'  }, 
  'l_1' => {'ru' => 'Теплопроводность', 'en' => 'Heat conduction', 'name' => 'Теплопроводность'  }, 
  'S_l' => {'ru' => 'Вектор Пойнтинга', 'en' => 'Poynting vector', 'name' => 'Вектор Пойтинга'  }, 
  'l_2' => {'ru' => 'Спектральная_плотность_облучённости', 'en' => '', 'name' => 'Спектральная плотность облучённости'  }, 

  'V3' => {'ru' => 'Объём', 'en' => 'Volume', 'name' => 'Объём'  }, 
  'S_a' => {'ru' => 'Атомная_тормозная_способность_вещества', 'en' => '', 'name' => 'Атомная тормозная способность вещества'  }, 
  'S' => {'ru' => 'Площадь', 'en' => 'Area', 'name' => 'Площадъ'  }, 
  'l1' => {'ru' => 'Длина', 'en' => 'Length', 'name' => 'Протяжённость'  }, 
  'Q' => {'ru' => 'Энергия', 'en' => 'Energy', 'name' => 'Энергия'  }, 
  'F' => {'ru' => 'Сила', 'en' => 'Force', 'name' => 'Сила'  }, 
  'alpha' => {'ru' => 'Телесный_угол', 'en' => 'Solid_angle', 'name' => 'Угол'  }, 
  'R' => {'ru' => 'Кривизна', 'en' => 'Curvature', 'name' => 'Кривизна'  }, 
  'k' => {'ru' => 'Жёсткость', 'en' => 'Stiffness', 'name' => 'Жёсткость'  }, 
  'P' => {'ru' => 'Давление', 'en' => 'Pressure', 'name' => 'Давление'  }, 
  'R2' => {'ru' => 'Кривизна_Гаусса', 'en' => 'Gaussian curvature', 'name' => 'Вторая кривизна'  }, 
  'n' => {'ru' => 'Концентрация частиц', 'en' => 'Number density', 'name' => 'Концентрация'  }, 
  'gamma' => {'ru' => 'Удельный вес', 'en' => 'Specific weight', 'name' => 'Удельный вес'  }, 


  'p_m' => {'ru' => 'Магнитный_момент', 'en' => 'Magnetic_moment', 'name' => 'Магнитный диполь'  }, 
  'L' => {'ru' => 'Момент_импульса', 'en' => 'Angular_momenum', 'name' => 'Момент импульса'  }, 
  'P_m' => {'ru' => 'Импульс', 'en' => 'Momentum', 'name' => 'Импульс'  }, 
  'Phi_m' => {'ru' => 'Магнитный_поток', 'en' => 'Magnetic_flux', 'name' => 'Магнитный поток'  }, 
  'v_s' => {'ru' => 'Скорость', 'en' => 'Velocity', 'name' => 'Скорость'  }, 
  'I' => {'ru' => 'Сила_тока', 'en' => 'Electric_current', 'name' => 'Сила тока'  }, 
  'H' => {'ru' => 'Напряжённость_магнитного_поля', 'en' => 'Auxiliary_magnetic_field', 'name' => 'Напряжённость магнитного поля'  }, 
  'B' => {'ru' => 'Магнитная_индукция', 'en' => 'Magnetic_field', 'name' => 'Магнитная индукция'  }, 
  'M_0' => {'ru' => 'Магнитный_монополь', 'en' => 'Magnetic monopole', 'name' => 'Монополь Дирака'  }, 
  'j' => {'ru' => 'Плотность_тока', 'en' => 'Current density', 'name' => 'Плотность электрического тока'  }, 
  'J' => {'ru' => 'Плотность_потока_ионизирующих_частиц', 'en' => '', 'name' => 'Плотность потока ионизирующих частиц'  }, 
  'v_m' => {'ru' => 'Скорость_химической_реакции', 'en' => '', 'name' => 'Плотность замедления'  }, 
  'Z_a' => {'ru' => 'Акустическое_сопротивление', 'en' => '', 'name' => 'Акустическое сопротивление'  }, 
 
  'j_e' => {'ru' => 'Момент_инерции', 'en' => 'Moment of inertia', 'name' => 'Момент инерции'  },
  'P_e' => {'ru' => 'Электрический_дипольный_момент', 'en' => 'Electric dipole moment', 'name' => 'Электрический дипольный момент'  },
  'S_m' => {'ru' => 'Массовая_тормозная_способность_вещества', 'en' => '', 'name' => 'Массовая тормозная способность вещества'  },
  'N' => {'ru' => 'Диполь', 'en' => 'Dipole', 'name' => 'Поток напряжённости'  },
  'm' => {'ru' => 'Масса', 'en' => 'Mass', 'name' => 'Масса'  }, 
  'tau' => {'ru' => 'Линейная_плотность', 'en' => 'Charge_density', 'name' => 'Линейная плотность' }, 
  'phi' => {'ru' => 'Электрическое_напряжение', 'en' => 'Voltage', 'name' => 'Круговая скорость' }, 
  'E' => {'ru' => 'Напряжённость_электрического_поля', 'en' => 'Electric_field', 'name' => 'Напряжённость электрического поля'  }, 
  'D' => {'ru' => 'Электрическая_индукция', 'en' => 'Electric_displacement_field', 'name' => 'Электрическая индукция'  }, 
  'rho_e' => {'ru' => 'Плотность_заряда', 'en' => 'Charge_density', 'name' => 'Плотность заряда'  }, 
  '1_eps' => {'ru' => 'Угловое_ускорение', 'en' => 'Angular_acceleration', 'name' => 'Угловое ускорение'  }, 
  'n_rho' => {'ru' => 'Уравнение непрерывности#Квантовая механика', 'en' => 'Continuity equation#Quantum mechanics', 'name' => 'Градиент плотности' },
  
  'K_e' => {'ru' => 'Керма-эквивалент_источника', 'en' => 'Kerma-source_equivalent', 'name' => 'Керма-эквивалент источника'  }, 
  'v3' => {'ru' => 'Массовый_расход', 'en' => '', 'name' => 'Спиральная скорость'  }, 
  '1/r' => {'ru' => 'Адмиттанс', 'en' => 'Admittance', 'name' => 'Адмиттанс'  }, 
  'sig' => {'ru' => 'Удельная_проводимость', 'en' => 'Electrical_conductivity', 'name' => 'Удельная проводимость'  }, 
  'D_r' => {'ru' => 'Доза_излучения#Мощность_дозы', 'en' => 'Kerma (physics)', 'name' => 'Мощность дозы излучения'  }, 

  '1/C' => {'ru' => 'Электрическая ёмкость', 'en' => 'Capacitance', 'name' => 'Атомный импеданс'  }, 
  'Eps_0' => {'ru' => 'Фундаментальные физические постоянные#Постоянные, связывающие разные системы единиц', 'en' => 'Vacuum permittivity', 'name' => 'Электрическая постоянная'  }, 
};

if ( exists $wiki->{$val} 
and 
defined $wiki->{$val}->{$lang} 
) {
$wiki_uri = $prot.$lang.$wiki_url.$wiki->{$val}->{$lang};
} else {
$wiki_uri = $spq;
}

print $q->redirect($wiki_uri);

#my $hash;
#map { $hash->{$_} = chr(ord($_)+1) } @vals;
#my $json = objToJson($hash);
#print "var jsonObj = $json";
